package org.example.lessons.lesson07.homeworks

fun main(){
    //Прямой диапазон
    //Напишите цикл for, который выводит числа от 1 до 5.
    //Напишите цикл for, который выводит четные числа от 1 до 10.

    for (i in 1..5){
        println(i)
    }
    println("_____________")

    for (i in 1..10){
        if (i%2 == 0){
            println(i)
        }
    }
    println("++++++++++++++")

    //Создайте цикл for, который выводит числа от 5 до 1.
    //Создайте цикл for, который выводит числа от 10 до 1, уменьшая их на 2.
    for (i in 5 downTo 1){
        println(i)
    }
    println("_____________")
    for (i in 10 downTo 1){
        println(i.toFloat()/2)
    }
    println("++++++++++++++")

    //Используйте цикл for с шагом 2 для вывода чисел от 1 до 9.
    //Напишите цикл for, который выводит каждое третье число в диапазоне от 1 до 20.

    for (i in 1..10 step 2){
        println(i)
    }
    println("_____________")

    for (i in 1..20){
        if (i%3 == 0){
            println(i)
        }
    }
    println("++++++++++++++")

    //Создайте числовую переменную 'size'. Используйте цикл for с шагом 2 для вывода чисел от 3 до size не включая size.

    val size = 30

    for (i in 3 until size step 2){
        println(i)
    }
    println("++++++++++++++")

    //Создайте цикл while, который выводит квадраты чисел от 1 до 5.
    //Напишите цикл while, который уменьшает число от 10 до 5. После этого вывести результат в консоль

    var i=0
    while (i++ < 5){
        println(i.times(i))
    }
    println("_____________")

    var c=10
    println(c)
    while (c-- > 5){
        println(c)
    }
    println("++++++++++++++")

    //Используйте цикл do while, чтобы вывести числа от 5 до 1.
    //Создайте цикл do while, который повторяется, пока счетчик меньше 10, начиная с 5.

    var d = 5
    do {
        println(d--)
    } while (d>=1)
    println("_____________")

    var t = 0
    do {
        println(t++)
    } while (t in 5..10)

    //Использование break
    //Напишите цикл for от 1 до 10 и используйте break, чтобы выйти из цикла при достижении 6.
    //Создайте цикл while, который бесконечно выводит числа, начиная с 1, но прерывается при достижении 10.
    println("!!!!!!!!!!!!!!!!!!!!!!")
    for (i in 0..10){
        println(i)
        if (i == 6) break
    }
    println("_____________")

    while (true){
        if (i == 10) break
        println(i++)
    }
    println("++++++++++++++")

    //Использование continue
    //В цикле for от 1 до 10 используйте continue, чтобы пропустить четные числа.
    //Напишите цикл while, который выводит числа от 1 до 10, но пропускает числа, кратные 3.

    for (i in 0..10){
        if (i%2 == 0) continue
        println(i)
    }
    println("_____________")

    var k=0
    while (k++ <10){
        if (k%3 == 0){
            println(k)
        }
    }

}